%陷波器设计举例
% 一、案例背景：在实际应用中几个信号的频率分布比较集中，用陷波滤波器滤除其中一个频带信号。
% 或信号的主要频率分布和单频噪声（干扰）比较接近，欲利用陷波器滤除噪声干扰，如要完全消除某些频率分量，
% 一般仪器或设备都用50Hz的交流电源供电，因而信号中时常带有50Hz的干扰，希望将它滤除，又不影响该信号。
% 二、原理描述：一个二阶滤波器，它的幅度特性在w0处为零，在其他频率上接近于常数，是一个滤除单频干扰的滤波器，
%在频率响应特征上包含了一个或多个深槽。
clear;
close all;

a1=exp(1i*0.125*pi);              %设置零点
a2=exp(-1i*0.125*pi); 

b1=0.95*exp(1i*0.125*pi);              %设置极点
b2=0.95*exp(-1i*0.125*pi); 

B=[1  -(a1+a2)  a1*a2];                %分子多项式系数
A=[1  -(b1+b2)  b1*b2];                %分母多项式系数

subplot(2,2,1),zplane(B,A);title('零极点分布图');            %绘零极点分布图

[H,w]=freqz(5*B,A);

subplot(2,2,2),plot(w/pi,abs(H));title('幅频特性曲线(dB)');grid on; %绘幅频特性曲线
xlabel('\omega/\pi');ylabel('|H(e^j^\omega)|');axis([0 1 0 6]); 

x=sin(2*pi*(1:8000)*200/8000)+sin(2*pi*(1:8000)*500/8000)+sin(2*pi*(1:8000)*800/8000); 
Xk=fft(x,1024); 
y=filter(B,A,x); 
Yk=fft(y,1024); 

subplot(2,2,3),plot(abs(Xk));ylabel('幅度');%输入信号频谱;
title('输入信号的频谱');axis([0 1024 0 600]);grid on;

subplot(2,2,4),plot(abs(Yk)); ylabel('幅度'); %输出信号频谱;
title('陷波器输出信号的频谱');axis([0 1024 0 600]);grid on;